cask 'aerial'                 # screensaver
cask 'devutils'               # developer utilities
cask 'docker'                 # docker for macos
cask 'free-ruler'             # screen ruler
cask 'hammerspoon'            # macos automation
cask 'hyperkey'               # keyboard shortcuts
cask 'iterm2'                 # terminal
cask 'kap'                    # screen recording
cask 'macdown'                # markdown editor   
cask 'postman'                # http client
cask 'runjs'                  # js/ts repl
cask 'skype'                  # instant messaging
cask 'sqlpro-for-sqlite'      # sqlite app
cask 'utm'                    # virtual machines
cask 'zoom'                   # video messaging
