tap 'homebrew/cask-fonts'

brew 'ansible-lint'         # linter for ansible files
brew 'ansible'              # config of virtual machines
brew 'bash'                 # shell script interpreter
brew 'bitwarden-cli'        # bitwarden command line
brew 'coreutils'            # basic tools
brew 'direnv'               # directory specific env-vars
brew 'docker-compose'       # multi container operation
brew 'docker'               # containers
brew 'fnm'                  # node version manager
brew 'fzf'                  # fuzzy text search
brew 'gh'                   # github command line
brew 'git'                  # version control
brew 'gnu-sed'              # stream text editor
brew 'grep'                 # search plain-text
brew 'hadolint'             # Dockerfiles linter
brew 'jq'                   # json query
brew 'neovim'               # text editor
brew 'sed'                  # text replacement utility
brew 'shellcheck'           # bash linter
brew 'shfmt'                # shell script formatter
brew 'stow'                 # symlink manager
brew 'terraform'            # provisioning tool
brew 'wallpaper'            # manage desktop wallpaper
brew 'yamllint'             # linter for YAML files
brew 'yarn'                 # nodejs package manager
brew 'z'                    # jump around directories
brew 'zsh'                  # shell

cask 'bitwarden'            # password manager
cask 'chromium'             # development browser
cask 'firefox'              # general use browser
cask 'font-hack'            # code font
cask 'visual-studio-code'   # code editor
