tap 'homebrew/cask-fonts'

brew 'antibody'             # zsh package manager
brew 'coreutils'            # basic tools
brew 'docker-compose'       # multi container operation
brew 'docker'               # containers
brew 'fzf'                  # fuzzy text search
brew 'git'                  # version control
brew 'gnu-sed'              # stream text editor
brew 'grep'                 # search plain-text
brew 'reattach-to-user-namespace' # macos tmux fixes
brew 'shellcheck'           # bash script lint
brew 'stow'                 # symlink manager
brew 'task'                 # task management
brew 'tmux'                 # terminal multiplexer
brew 'tmuxinator'           # tmux session manager
brew 'vim'                  # text editor
brew 'wallpaper'            # manage desktop wallpaper
brew 'z'                    # jump around directories
brew 'zsh'                  # shell
brew 'direnv'               # directory specific env-vars

brew 'jq'                   # json query
brew 'awscli'               # aws cli
brew 'cfn-lint'             # aws cloudformation linter

cask 'bitwarden'            # password manager
cask 'chromium'             # development browser
cask 'firefox'              # general use browser
cask 'font-hack'            # code font
cask 'visual-studio-code'   # code editor
