tap "sst/tap"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Manage multiple git users on one machine
brew "gituser"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Painless compression and decompression for your terminal
brew "ouch"
# Command-line interface for SQLite
brew "sqlite"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Apple TV Aerial screensaver
cask "aerial"
# Desktop password and login vault
cask "bitwarden"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Remove junk and unused files
cask "mole"
