tap "sst/tap"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Modern shell for the GitHub era
brew "nushell"
# Painless compression and decompression for your terminal
brew "ouch"
# Command-line interface for SQLite
brew "sqlite"
# Manage the desktop wallpaper
brew "wallpaper"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Apple TV Aerial screensaver
cask "aerial"
# Desktop password and login vault
cask "bitwarden"
# Remove junk and unused files
cask "ccleaner"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Web browser
cask "firefox"
# Screenshot software with built-in annotation tools
cask "flameshot"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Connect to Windows
cask "windows-app"
